
* ATX Spec

| ! |               | in           | mm               | final              |
|---+---------------+--------------+------------------+--------------------|
|   | Width         | 9.6          | 243.84           | [26.035, 25.4]     |
|   | Height        | 12           | 304.8            | [32.131, 31.496]   |
|   | Hole Diameter | 0.156        | 3.9624           | [2.04724, 1.41224] |
| _ |               |              | offset           |                    |
| # | Hole offset   | [0.554, .4]  | [14.0716, 10.16] | [28.1432, 20.32]   |
|---+---------------+--------------+------------------+--------------------|
| # | Hole 1        | [0,     0]   | [0., 0.]         | [14.0716, 10.16]   |
| # | Hole 2        | [3.1,   0]   | [78.74, 0.]      | [92.8116, 10.16]   |
| # | Hole 3        | [4.9,   0]   | [124.46, 0.]     | [138.5316, 10.16]  |
| # | Hole 4        | [11.1, .9]   | [281.94, 22.86]  | [296.0116, 33.02]  |
|---+---------------+--------------+------------------+--------------------|
| # | Hole 5        | [0,    6.1]  | [0., 154.94]     | [14.0716, 165.1]   |
| # | Hole 6        | [4.9,  6.1]  | [124.46, 154.94] | [138.5316, 165.1]  |
| # | Hole 7        | [11.1, 6.1]  | [281.94, 154.94] | [296.0116, 165.1]  |
|---+---------------+--------------+------------------+--------------------|
| # | Hole 8        | [0,    8.95] | [0., 227.33]     | [14.0716, 237.49]  |
| # | Hole 9        | [4.9,  8.95] | [124.46, 227.33] | [138.5316, 237.49] |
| # | Hole 10       | [11.1, 8.95] | [281.94, 227.33] | [296.0116, 237.49] |
#+TBLFM: $4=$in*2.54*10::$5=$mm+$offset

#+BEGIN_SRC emacs-lisp
(calc-alg-entry "9.6")
(calc-convert-units "9.6 in" "mm")
#+END_SRC
